Revit 2024 API
ElementTypeDuplicatedEventArgs Class
 The event arguments used by the ElementTypeDuplicated event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class ElementTypeDuplicatedEventArgs : RevitAPIPostDocEventArgs
Visual Basic
Public Class ElementTypeDuplicatedEventArgs _
	Inherits RevitAPIPostDocEventArgs
Visual C++
public ref class ElementTypeDuplicatedEventArgs : public RevitAPIPostDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.ElementTypeDuplicatedEventArgs
See Also
ElementTypeDuplicatedEventArgs Members
Autodesk.Revit.DB.Events Namespace